{
    "references": [
        {
            "reference": null,
            "name": "Erlich Bachman"
        }
    ],
    "interests": [
        {
            "name": "Wildlife",
            "keywords": [
                "Ferrets",
                "Unicorns"
            ]
        }
    ],
    "languages": [
        {
            "language": "English",
            "fluency": "Native speaker"
        }
    ],
    "skills": [
        {
            "name": "PHP",
            "level": "Master",
            "keywords": [
                "HTML",
                "CSS",
                "Javascript",
                "SDSDF",
                "zfvzdfvzdfvadsfv",
                "dfzbxdfgxfdhbdxfg",
                "xdfhbxfgbhxfgb"
            ]
        }
    ],
    "basics": {
        "picture": "",
        "label": "Software Engineer",
        "name": "Ryan Parman",
        "website": "http://ryanparman.com",
        "location": {
            "city": "Santa Clara",
            "region": "California",
            "countryCode": "US"
        },
        "email": "jobs@ryanparman.com",
        "profiles": [
            {
                "network": "AngelList",
                "url": "https://angel.co/skyzyx",
                "username": "skyzyx"
            },
            {
                "network": "Bitly",
                "url": "http://bitly.com/u/skyzyx",
                "username": "skyzyx"
            },
            {
                "network": "Coinbase",
                "url": "https://coinbase.com/skyzyx",
                "username": "skyzyx"
            },
            {
                "network": "Facebook",
                "url": "http://facebook.com/rparman",
                "username": "rparman"
            },
            {
                "network": "GitHub",
                "url": "http://github.com/skyzyx",
                "username": "skyzyx"
            },
            {
                "network": "Goodreads",
                "url": "http://goodreads.com/skyzyx",
                "username": "skyzyx"
            },
            {
                "network": "HackerOne",
                "url": "https://hackerone.com/skyzyx",
                "username": "skyzyx"
            },
            {
                "network": "Keybase",
                "url": "http://keybase.io/skyzyx",
                "username": "skyzyx"
            },
            {
                "network": "Last.fm",
                "url": "http://last.fm/user/skyzyx",
                "username": "skyzyx"
            },
            {
                "network": "Letterboxd",
                "url": "http://letterboxd.com/skyzyx/",
                "username": "skyzyx"
            },
            {
                "network": "LinkedIn",
                "url": "http://linkedin.com/in/rparman",
                "username": "rparman"
            },
            {
                "network": "trakt.tv",
                "url": "http://trakt.tv/user/skyzyx",
                "username": "skyzyx"
            },
            {
                "network": "Twitter",
                "url": "http://twitter.com/skyzyx",
                "username": "skyzyx"
            },
            {
                "network": "YouTube",
                "url": "http://youtube.com/skyzyx",
                "username": "skyzyx"
            }
        ],
        "summary": "Ryan Parman is experienced at nearly every level of the web stack, from the frontend to the backend, to the systems, servers, and ops. He is an engineer who is fiercely passionate about the user experience and interaction of a product. He inherently understands that the customer is the single most valuable asset an organization can have, and is driven by the unrelenting pursuit of customer-driven focus, ideals and user experience.\n"
    },
    "education": [
        {
            "studyType": "Bachelor",
            "gpa": "3.84",
            "startDate": "2001-09",
            "area": "Design and Visualization",
            "endDate": "2003-11",
            "institution": "Silicon Valley College (now Carrington College, part of DeVry University)"
        }
    ],
    "work": [
        {
            "company": "WePay",
            "website": "https://www.wepay.com",
            "position": "Senior Software Engineer",
            "startDate": "2014-04",
            "endDate": "Present",
            "summary": "As a member of the API team, Ryan was involved in developing new API endpoints to help expand\nWePay’s business and support its partners. In particular, he was instrumental in developing\nWePay’s Multifactor-Authentication-as-a-Service offering. Ryan also continues to be heavily\ninvolved in the security of WePay’s products, coordinating fixes with teams against other\npriorities, and fixing the issues himself in many cases.\n\nRyan currently works as a member of the DevOps team, working to improve how WePay provisions\ncloud infrastructure, deploys updates, manages security fixes, monitors applications and\ninfrastructure, and streamlines the process of planning, developing, deploying and maintaining\nnew micro-services throughout the company.\n\nRyan is also the resident Scrum Master (non-certified) for the DevOps team, and spends part of\nhis time acting in a Technical Program Manager (TPM) capacity.\n"
        },
        {
            "company": "Amazon",
            "website": "https://aws.amazon.com",
            "position": "Web Development Engineer II, Amazon Web Services",
            "startDate": "2010-03",
            "endDate": "2014-04",
            "summary": "Ryan is the creator and visionary behind the AWS SDK for PHP — AWS's SDK for rapidly building\ncloud-based web applications (launched September 2010). He invests heavily in supporting the\nneeds of developers by taking the time to listen and understand the needs of developers, and\nis involved in PHP-related industry groups on behalf of AWS.\n\nRyan worked with the AWS Elastic Beanstalk team to provide PHP support for the platform\n(launched March 2012). In addition to working with the PHP community to determine the\nconfiguration for a PHP container that would fit the greatest number of developers, he\ndeveloped a rigorous internal test suite for testing containers which has been used as the\nbasis for testing by other language-specific teams. He also had early input on adding support\nfor git push deployments.\n\nRyan was heavily involved in the creation and development of the AWS SDK for PHP 2 — a\nbest-of-breed SDK (backed by Guzzle — a best-of-breed HTTP framework) that takes into account\nthe numerous changes in the PHP language and community since Tarzan/CloudFusion was first\nwritten in 2005 (launched November 2012).\n\nRyan also works with the AWS Design team on the AWS Management Console, where he lends his\nexperience as a web developer and software engineer to bridge the gap between the design and\nengineering disciplines in an effort to build a high-quality, robust, user-friendly console\nfor interacting with Amazon Web Services.\n"
        },
        {
            "company": "CloudFusion (née Tarzan) — Open-Source Project",
            "website": "https://aws.amazon.com/awsforphp",
            "position": "Creator and Developer",
            "startDate": "2005-01",
            "endDate": "2010-03",
            "summary": "CloudFusion is a fast, powerful PHP toolkit for building awesome, cloud-based web applications\nin a fraction of the time! Design decisions are made in the best interests of performance,\nease of use, and overall usability. Goals are to provide a high-performance developer toolkit\nfor leveraging Amazon's cloud infrastructure, to grow the community and, and to build useful\nuser-centric apps based on the toolkit.\n"
        },
        {
            "company": "Rearden Commerce (now Deem)",
            "website": "https://www.deem.com",
            "position": "Senior User Experience Developer",
            "startDate": "2008-07",
            "endDate": "2010-03",
            "summary": "As a front-end engineer, Ryan was responsible for supporting the user experience team, Java\ndevelopers, and widget development teams. This involved prototyping new features, integration\nof those new features into the code base, migrating JavaScript code from older frameworks to\nYUI 2.x, and educating other teams on the value of high-quality front-end code — all while\nplacing a huge emphasis on writing front-end code with better performance, faster load times,\nand improved accessibility across the board.\n"
        },
        {
            "position": "Co-Founder and Chief Information Officer",
            "company": "Foleeo (later, WarpShare)",
            "startDate": "2006-09",
            "endDate": "2010-03",
            "summary": "WarpShare's business model was to support artists and copyright holders by building ways to\ncapture value from the piracy which was already happening, and introducing a then-innovative\nbusiness model around sponsorships. Over time, companies like Apple, Twitter, and Readability\ncame in with similar ideas. WarpShare officially shut down in 2013.\n"
        },
        {
            "position": "Creator and Co-Developer",
            "company": "SimplePie — Open-Source Project",
            "startDate": "2004-07",
            "endDate": "2009-10",
            "summary": "Ryan is the creator, evangelist, and co-developer of the SimplePie project — a PHP library\nthat enables web developers to simply and easily integrate news feeds into their websites and\nweb applications.\n\nAfter recruiting additional development resources in June 2005, Ryan began to shift from a\nprimarily development-focused role to a primarily people-focused role, where he currently\nworks to ensure that people are aware of, and can easily use SimplePie through support,\ndocumentation, tutorials, plugins, and evangelism.\n"
        },
        {
            "position": "Consulting and development services",
            "company": "Self-Employed",
            "startDate": "2007",
            "endDate": "2009",
            "summary": "As a freelance developer, Ryan leverages a deep understanding of best practices in front-end\ndevelopment, layout and design, information architecture, usability, accessibility, and web\nculture to provide value to clients. He provides guidance to people and teams about how to\nmaintain best practices after the project ends.\n"
        },
        {
            "position": "Front-end Web Developer (Contract), Yahoo! Messenger",
            "company": "Yahoo!",
            "startDate": "2007-11",
            "endDate": "2008-01",
            "summary": "Ryan lead the front-end development of the Spring 2008 re-launch of the Yahoo! Messenger\nwebsite. He collaborated with a core team of developers to provide increased usability,\naccessibility, organic search engine optimization (SEO), and simplified maintenance, resulting\nin exceptionally tuned performance for 29 locales.\n\nRyan was involved in tuning the front-end stack for performance, where they employed\nsemantically valid HTML/CSS, caching, gzipping, image spriting, code minification, and reduced\nHTTP requests, resulting in exceptional performance.\n"
        },
        {
            "position": "User Interface Developer (Contract)",
            "company": "Stryker",
            "startDate": "2005-05",
            "endDate": "2006-09",
            "summary": "Ryan was a core member of the team tasked with re-building the company intranet site around\nOracle Portal. His time was spent writing and discussing functional and technical\ndocumentation, conducting usability interviews, and creating a fresh UI that employed\nuser-centered design principles, web standards, and AJAX technologies.\n\nRyan was also a member of the Endora Marketing Team, which was geared towards spreading\ninformation about the company's move to Oracle's ERP software. In that capacity, Ryan\nmaintained the Endora website, wrote numerous articles for the monthly newsletter, interviewed\nproject leads, and created fun little ERP-related polls to help drive interest in the project.\n\nRyan worked with the eBusiness team to improve maintenance and development for the UI of the\nGlobalSource project. He also re-engineered the Stryker Endoscopy public site to follow modern\nweb standards, and built a PHP-based templating system for the site that significantly sped up\ndevelopment.\n"
        },
        {
            "position": "Production Specialist",
            "company": "Digital Impact (now Acxiom Impact)",
            "startDate": "2004-03",
            "endDate": "2005-04",
            "summary": "Ryan coordinated with Campaign Managers on email campaign integration, with responsibility for\nemail content and change requests, and ensuring that the content format was consistent with\nclient requirements. He performed the quality tracking and reporting of campaign\nintegration-related metrics, and consulted and troubleshot on text and HTML templates.\n\nRyan maintained HTML code guidelines, provided optimal design and processing, and provided\nsuggestions for strategic and process improvements. He also acted as syndication expert for\nthe internal RSS development team.\n\nRyan's client experience included Banana Republic, SBC (now AT&T), Hewlett Packard (HP), Sony\nStyle, Lexus, MAC Make-up.\n"
        }
    ],
    "publications": [
        {
            "publisher": "WePay, Inc.",
            "releaseDate": "2015",
            "summary": "A new approach is proposed that contemplates systems and methods to support verification of a user’s authentication information across multiple websites/domains owned and/or operated by different entities, which share users during a single session. When the user attempts to login to a first website/domain, he/she is required to provide authentication information in addition to user-id/password. An authentication platform is configured to generate and communicate the additional authentication information to the user and verify the additional authentication information the user provided to the first website/domain. When the user later attempts to access a second/unrelated website/domain, the verified additional authentication information is provided by the first website/domain to the second website/domain in the form of a signed cookie. The second website/domain parses the cookie and provides the additional authentication information to the authentication platform for verification without requiring the user to input it again at the second website/domain.\n",
            "name": "System and Methods for User Authentication across Multiple Domains (Provisional)"
        },
        {
            "publisher": "Foleeo, Inc.",
            "releaseDate": "2008-03-20",
            "website": "http://google.com/patents/US8103870",
            "summary": "A collaborative data transferring process can combine segments from all known servers and peer-to-peer (P2P) sources simultaneously, regardless of their native protocols. The process uses variable data block size that can be dynamically selected according to sizes provided by sources, e.g., according to the protocol of the source, and can generate hash values or validation codes on the fly so that compliance with validation techniques (if any) of other protocols is not required. The process may be classified as a P2P protocol, although it also contains centralized elements. Machine language implementations and low syntax overhead allow file exchanges over a homogeneous network with high throughput and low bandwidth consumption.\n",
            "name": "Hive-based Peer-to-Peer Network (WO/2008/033424)"
        }
    ]
}
